import moment from 'moment-jalaali';
import { useContext } from 'react';
import { ArticleContext } from '../contexts/article-context';

const ArticleItems = ({item,handleSelectedArticle})=>{

 // تنظیمات اولیه moment برای حالت شمسی
moment.loadPersian({usePersianDigits: true});

// تابع تبدیل تاریخ به شمسی و فرمت مطلوب
function convertToJalali(dateTime) {
    // تنظیم زمان به UTC و تبدیل به فرمت شمسی دلخواه
    const jalaliDate = moment.utc(dateTime).local().format('dddd، jD jMMMM jYYYY');
    return jalaliDate;
}

// تابع تبدیل زمان به فرمت مطلوب
function convertToPersianTime(dateTime) {
    // تنظیم زمان به UTC و استخراج ساعت و دقیقه به صورت HH:mm
    const persianTime = moment.utc(dateTime).local().format('HH:mm');
    // تبدیل اعداد به فارسی
    return persianTime.replace(/\d/g, digit => '۰۱۲۳۴۵۶۷۸۹'[digit]);
}

//const {handleSelectedArticle}=useContext(ArticleContext)

    return(<>
                <div onClick={()=>handleSelectedArticle(item)} className="flex w-full p-4 justify-between sm:justify-normal sm:gap-10">
                    <div  className="sm:w-1/4 w-1/3 rounded-md  relative">
                        <img className="object-cover rounded-md" src={"https://safarico.liara.run/storage/"+item.media.file_path} alt="image" />
                        <div className="absolute -inset-y-10 sm:inset-0 flex flex-col justify-between rounded-md p-4">
                            <div className="flex justify-end"><button className="sm:bg-secondary-300 bg-inherit text-secondary-300 sm:text-black p-1 sm:text-sm text-xs rounded-md">گردشگری</button></div>
                        </div>
                    </div>
                    <div className="flex flex-col justify-between gap-4 py-4 w-1/2">
                        <div className="font-bold text-sm sm:text-md">{item.title}</div>
                        <div className="text-xs sm:text-sm">{item.summery}</div>
                        <div>
                            <div className="flex gap-2 items-center text-xs text-naturalGray-300">
                                <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
                                    <path d="M6 4.3125C5.6925 4.3125 5.4375 4.0575 5.4375 3.75V1.5C5.4375 1.1925 5.6925 0.9375 6 0.9375C6.3075 0.9375 6.5625 1.1925 6.5625 1.5V3.75C6.5625 4.0575 6.3075 4.3125 6 4.3125Z" fill="#B7B7B7"/>
                                    <path d="M12 4.3125C11.6925 4.3125 11.4375 4.0575 11.4375 3.75V1.5C11.4375 1.1925 11.6925 0.9375 12 0.9375C12.3075 0.9375 12.5625 1.1925 12.5625 1.5V3.75C12.5625 4.0575 12.3075 4.3125 12 4.3125Z" fill="#B7B7B7"/>
                                    <path d="M15.375 7.37988H2.625C2.3175 7.37988 2.0625 7.12488 2.0625 6.81738C2.0625 6.50988 2.3175 6.25488 2.625 6.25488H15.375C15.6825 6.25488 15.9375 6.50988 15.9375 6.81738C15.9375 7.12488 15.6825 7.37988 15.375 7.37988Z" fill="#B7B7B7"/>
                                    <path d="M12 17.0625H6C3.2625 17.0625 1.6875 15.4875 1.6875 12.75V6.375C1.6875 3.6375 3.2625 2.0625 6 2.0625H12C14.7375 2.0625 16.3125 3.6375 16.3125 6.375V12.75C16.3125 15.4875 14.7375 17.0625 12 17.0625ZM6 3.1875C3.855 3.1875 2.8125 4.23 2.8125 6.375V12.75C2.8125 14.895 3.855 15.9375 6 15.9375H12C14.145 15.9375 15.1875 14.895 15.1875 12.75V6.375C15.1875 4.23 14.145 3.1875 12 3.1875H6Z" fill="#B7B7B7"/>
                                    <path d="M6.375 10.875C6.2775 10.875 6.18 10.8525 6.09 10.815C6 10.7775 5.91751 10.725 5.84251 10.6575C5.77501 10.5825 5.72249 10.5 5.68499 10.41C5.64749 10.32 5.625 10.2225 5.625 10.125C5.625 9.93001 5.70751 9.73502 5.84251 9.59252C5.91751 9.52502 6 9.4725 6.09 9.435C6.225 9.375 6.37501 9.36 6.52501 9.39C6.57001 9.3975 6.615 9.4125 6.66 9.435C6.705 9.45 6.75 9.47252 6.795 9.50252C6.8325 9.53252 6.86999 9.56252 6.90749 9.59252C6.93749 9.63002 6.97499 9.66751 6.99749 9.70501C7.02749 9.75001 7.05001 9.79501 7.06501 9.84001C7.08751 9.885 7.10251 9.93 7.11001 9.975C7.11751 10.0275 7.125 10.0725 7.125 10.125C7.125 10.32 7.04249 10.515 6.90749 10.6575C6.76499 10.7925 6.57 10.875 6.375 10.875Z" fill="#B7B7B7"/>
                                    <path d="M9 10.8749C8.805 10.8749 8.61001 10.7924 8.46751 10.6574C8.43751 10.6199 8.40751 10.5824 8.37751 10.5449C8.34751 10.4999 8.32499 10.4549 8.30999 10.4099C8.28749 10.3649 8.27249 10.3199 8.26499 10.2749C8.25749 10.2224 8.25 10.1774 8.25 10.1249C8.25 10.0274 8.27249 9.9299 8.30999 9.8399C8.34749 9.7499 8.40001 9.66741 8.46751 9.59241C8.67751 9.38241 9.015 9.31489 9.285 9.43489C9.3825 9.47239 9.45749 9.52491 9.53249 9.59241C9.66749 9.73491 9.75 9.9299 9.75 10.1249C9.75 10.1774 9.74251 10.2224 9.73501 10.2749C9.72751 10.3199 9.71251 10.3649 9.69001 10.4099C9.67501 10.4549 9.65249 10.4999 9.62249 10.5449C9.59249 10.5824 9.56249 10.6199 9.53249 10.6574C9.45749 10.7249 9.3825 10.7774 9.285 10.8149C9.195 10.8524 9.0975 10.8749 9 10.8749Z" fill="#B7B7B7"/>
                                    <path d="M6.375 13.4999C6.2775 13.4999 6.18 13.4774 6.09 13.4399C6 13.4024 5.91751 13.3499 5.84251 13.2824C5.77501 13.2074 5.72249 13.1324 5.68499 13.0349C5.64749 12.9449 5.625 12.8474 5.625 12.7499C5.625 12.5549 5.70751 12.3599 5.84251 12.2174C5.91751 12.1499 6 12.0974 6.09 12.0599C6.3675 11.9399 6.69749 12.0074 6.90749 12.2174C6.93749 12.2549 6.97499 12.2924 6.99749 12.3299C7.02749 12.3749 7.05001 12.4199 7.06501 12.4649C7.08751 12.5099 7.10251 12.5549 7.11001 12.6074C7.11751 12.6524 7.125 12.7049 7.125 12.7499C7.125 12.9449 7.04249 13.1399 6.90749 13.2824C6.76499 13.4174 6.57 13.4999 6.375 13.4999Z" fill="#B7B7B7"/>
                                </svg>{convertToJalali(item.created_at)}
                            </div>
                            <div className="flex gap-2 items-center text-xs text-naturalGray-300"><svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
                                <path d="M9 17.0625C4.5525 17.0625 0.9375 13.4475 0.9375 9C0.9375 4.5525 4.5525 0.9375 9 0.9375C13.4475 0.9375 17.0625 4.5525 17.0625 9C17.0625 13.4475 13.4475 17.0625 9 17.0625ZM9 2.0625C5.175 2.0625 2.0625 5.175 2.0625 9C2.0625 12.825 5.175 15.9375 9 15.9375C12.825 15.9375 15.9375 12.825 15.9375 9C15.9375 5.175 12.825 2.0625 9 2.0625Z" fill="#B7B7B7"/>
                                <path d="M11.783 11.9476C11.6855 11.9476 11.588 11.9251 11.498 11.8651L9.17297 10.4776C8.59547 10.1326 8.16797 9.37507 8.16797 8.70757V5.63257C8.16797 5.32507 8.42297 5.07007 8.73047 5.07007C9.03797 5.07007 9.29297 5.32507 9.29297 5.63257V8.70757C9.29297 8.97757 9.51797 9.37507 9.75047 9.51007L12.0755 10.8976C12.3455 11.0551 12.428 11.4001 12.2705 11.6701C12.158 11.8501 11.9705 11.9476 11.783 11.9476Z" fill="#B7B7B7"/>
                            </svg>{convertToPersianTime(item.created_at)}
                            </div>
                        </div>
                    </div>
                </div>
               
            </>)
}
export default ArticleItems;